bivex/ArchC/tests/esp32s3/esp32s3_isa.H
/******************************************************
 * Instruction Set Architecture header file.          *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#ifndef _ESP32S3_ISA_H
#define _ESP32S3_ISA_H

#include "esp32s3_parms.H"
#include "ac_instr.H"
#include "ac_decoder_rt.H"
#include "ac_instr_info.H"
#include "esp32s3_arch.H"
#include "esp32s3_arch_ref.H"
#include "esp32s3_syscall.H"

namespace esp32s3_parms
{
class esp32s3_isa: public esp32s3_arch_ref {
private:
typedef ac_instr<AC_DEC_FIELD_NUMBER> ac_instr_t;

public:
  static ac_dec_field fields[AC_DEC_FIELD_NUMBER];
  static ac_dec_format formats[AC_DEC_FORMAT_NUMBER];
  static ac_dec_list dec_list[AC_DEC_LIST_NUMBER];
  static ac_dec_instr instructions[AC_DEC_INSTR_NUMBER];
  static const ac_instr_info instr_table[AC_DEC_INSTR_NUMBER + 1];

  static const unsigned instr_format_table[AC_DEC_INSTR_NUMBER + 1];

  ac_decoder_full* decoder;

  esp32s3_syscall syscall;
  //!Constructor.
  esp32s3_isa(esp32s3_arch& ref) : esp32s3_arch_ref(ref) , syscall(ref) {
    //!Building Decoder.
    decoder = ac_decoder_full::CreateDecoder(esp32s3_isa::formats, esp32s3_isa::instructions, &ref);
  }

  inline __attribute__((always_inline)) void _behavior_instruction(uint8_t op);

  inline __attribute__((always_inline)) void _behavior_begin();
  inline __attribute__((always_inline)) void _behavior_end();

  inline __attribute__((always_inline)) void _behavior_esp32s3_Type_RRR(uint8_t op, uint8_t op1, uint8_t r, uint8_t s, uint8_t t, uint8_t op2);
  inline __attribute__((always_inline)) void _behavior_esp32s3_Type_RRI8(uint8_t op, int8_t imm8, uint8_t s, uint8_t t, uint8_t pad1);
  inline __attribute__((always_inline)) void _behavior_esp32s3_Type_RI16(uint8_t op, uint8_t t, int16_t imm16, uint8_t pad2);
  inline __attribute__((always_inline)) void _behavior_esp32s3_Type_L32I(uint8_t op, uint8_t disp, uint8_t s, uint8_t t, uint8_t pad3);
  inline __attribute__((always_inline)) void _behavior_esp32s3_Type_Branch(uint8_t op, int16_t bdisp, uint8_t s, uint8_t t, uint8_t pad4);
  inline __attribute__((always_inline)) void _behavior_esp32s3_Type_Jump(uint8_t op, int32_t target, uint8_t pad5);
  inline __attribute__((always_inline)) void _behavior_esp32s3_Type_Loop(uint8_t op, uint8_t ldisp, uint8_t s, uint16_t pad6);
  inline __attribute__((always_inline)) void _behavior_esp32s3_Type_PIE(uint8_t op, uint8_t qr, uint8_t qs, uint8_t qt, uint8_t mode, uint8_t pad8);
  inline __attribute__((always_inline)) void _behavior_esp32s3_Type_Halt(uint8_t op, uint32_t pad7);

  inline __attribute__((always_inline)) void behavior_add_op(uint8_t op, uint8_t op1, uint8_t r, uint8_t s, uint8_t t, uint8_t op2);
  inline __attribute__((always_inline)) void behavior_sub_op(uint8_t op, uint8_t op1, uint8_t r, uint8_t s, uint8_t t, uint8_t op2);
  inline __attribute__((always_inline)) void behavior_and_op(uint8_t op, uint8_t op1, uint8_t r, uint8_t s, uint8_t t, uint8_t op2);
  inline __attribute__((always_inline)) void behavior_or_op(uint8_t op, uint8_t op1, uint8_t r, uint8_t s, uint8_t t, uint8_t op2);
  inline __attribute__((always_inline)) void behavior_xor_op(uint8_t op, uint8_t op1, uint8_t r, uint8_t s, uint8_t t, uint8_t op2);
  inline __attribute__((always_inline)) void behavior_mull_op(uint8_t op, uint8_t op1, uint8_t r, uint8_t s, uint8_t t, uint8_t op2);
  inline __attribute__((always_inline)) void behavior_addi_op(uint8_t op, int8_t imm8, uint8_t s, uint8_t t, uint8_t pad1);
  inline __attribute__((always_inline)) void behavior_addmi_op(uint8_t op, int8_t imm8, uint8_t s, uint8_t t, uint8_t pad1);
  inline __attribute__((always_inline)) void behavior_movi_op(uint8_t op, uint8_t t, int16_t imm16, uint8_t pad2);
  inline __attribute__((always_inline)) void behavior_l32i_op(uint8_t op, uint8_t disp, uint8_t s, uint8_t t, uint8_t pad3);
  inline __attribute__((always_inline)) void behavior_s32i_op(uint8_t op, uint8_t disp, uint8_t s, uint8_t t, uint8_t pad3);
  inline __attribute__((always_inline)) void behavior_bne_op(uint8_t op, int16_t bdisp, uint8_t s, uint8_t t, uint8_t pad4);
  inline __attribute__((always_inline)) void behavior_beq_op(uint8_t op, int16_t bdisp, uint8_t s, uint8_t t, uint8_t pad4);
  inline __attribute__((always_inline)) void behavior_blt_op(uint8_t op, int16_t bdisp, uint8_t s, uint8_t t, uint8_t pad4);
  inline __attribute__((always_inline)) void behavior_bge_op(uint8_t op, int16_t bdisp, uint8_t s, uint8_t t, uint8_t pad4);
  inline __attribute__((always_inline)) void behavior_j_op(uint8_t op, int32_t target, uint8_t pad5);
  inline __attribute__((always_inline)) void behavior_call0_op(uint8_t op, int32_t target, uint8_t pad5);
  inline __attribute__((always_inline)) void behavior_loop_op(uint8_t op, uint8_t ldisp, uint8_t s, uint16_t pad6);
  inline __attribute__((always_inline)) void behavior_ee_vadd_s16(uint8_t op, uint8_t qr, uint8_t qs, uint8_t qt, uint8_t mode, uint8_t pad8);
  inline __attribute__((always_inline)) void behavior_ee_vmul_s16(uint8_t op, uint8_t qr, uint8_t qs, uint8_t qt, uint8_t mode, uint8_t pad8);
  inline __attribute__((always_inline)) void behavior_ee_vdot_s8(uint8_t op, uint8_t qr, uint8_t qs, uint8_t qt, uint8_t mode, uint8_t pad8);
  inline __attribute__((always_inline)) void behavior_ee_vld_q(uint8_t op, uint8_t qr, uint8_t qs, uint8_t qt, uint8_t mode, uint8_t pad8);
  inline __attribute__((always_inline)) void behavior_ee_vst_q(uint8_t op, uint8_t qr, uint8_t qs, uint8_t qt, uint8_t mode, uint8_t pad8);
  inline __attribute__((always_inline)) void behavior_halt_op(uint8_t op, uint32_t pad7);

};
};



#endif //_ESP32S3_ISA_H

